# H-HTU21 and T-HTU21 measures

First I will try to read the data from sensor H-DHT11 and T-DHT11 measures separately

In [114]:
import csv
import pandas as pd
import numpy as np
import json

In [115]:
df = pd.read_csv('../data/raw/measures/H-HTU21-measures.csv')

In [116]:
data = []
with open('../data/raw/measures/T-HTU21-measures.json','r') as f:
    for line in f:
        data.append(json.loads(line))

df1 = pd.DataFrame(data)

In [117]:
df.head()

    sensor  value                  time
0  H-HTU21   28.3  2017-12-20T12:17:05Z
1  H-HTU21   28.2  2017-12-20T12:17:07Z
2  H-HTU21   28.1  2017-12-20T12:17:09Z
3  H-HTU21   28.2  2017-12-20T12:17:11Z
4  H-HTU21   28.2  2017-12-20T12:17:13Z

In [118]:
df.tail()

          sensor  value                  time
1428372  H-HTU21   30.8  2018-03-13T11:41:55Z
1428373  H-HTU21   30.8  2018-03-13T11:41:59Z
1428374  H-HTU21   30.8  2018-03-13T11:42:03Z
1428375  H-HTU21   31.0  2018-03-13T11:42:07Z
1428376  H-HTU21   33.6  2018-03-13T11:42:12Z

In [119]:
df1.head()

    sensor                  time  value
0  T-HTU21  2017-12-20T12:17:05Z  25.09
1  T-HTU21  2017-12-20T12:17:07Z  25.09
2  T-HTU21  2017-12-20T12:17:09Z  25.09
3  T-HTU21  2017-12-20T12:17:11Z  25.09
4  T-HTU21  2017-12-20T12:17:13Z  25.08

In [120]:
df1.tail()

          sensor                  time  value
1428378  T-HTU21  2018-03-13T11:41:55Z  26.57
1428379  T-HTU21  2018-03-13T11:41:59Z  26.56
1428380  T-HTU21  2018-03-13T11:42:03Z  26.58
1428381  T-HTU21  2018-03-13T11:42:07Z  26.58
1428382  T-HTU21  2018-03-13T11:42:11Z  26.58

In [121]:
df.columns

Index(['sensor', 'value', 'time'], dtype='object')

In [122]:
df.count()

sensor    1428377
value     1428377
time      1428377
dtype: int64

In [123]:
df1.columns

Index(['sensor', 'time', 'value'], dtype='object')

In [124]:
df1.count()

sensor    1428383
time      1428383
value     1428383
dtype: int64

In [125]:
df.isnull().sum()

sensor    0
value     0
time      0
dtype: int64

In [126]:
df.dtypes

sensor     object
value     float64
time       object
dtype: object

In [127]:
df.isnull().sum()

sensor    0
value     0
time      0
dtype: int64

In [128]:
df1.dtypes

sensor     object
time       object
value     float64
dtype: object

In [129]:
df1.isnull().sum()

sensor    0
time      0
value     0
dtype: int64

In [130]:
df.describe()

              value
count  1.428377e+06
mean   3.434038e+01
std    4.954117e+00
min    1.970000e+01
25%    3.040000e+01
50%    3.440000e+01
75%    3.730000e+01
max    5.630000e+01

In [131]:
df1.describe()

              value
count  1.428383e+06
mean   2.153985e+01
std    2.573268e+00
min    1.508000e+01
25%    2.026000e+01
50%    2.181000e+01
75%    2.334000e+01
max    2.821000e+01

Convert time column into date time format

In [132]:
df['time'] = pd.to_datetime(df['time'])
df1['time'] = pd.to_datetime(df1['time'])

In [133]:
df.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1428377 entries, 0 to 1428376
Data columns (total 3 columns):
sensor    1428377 non-null object
value     1428377 non-null float64
time      1428377 non-null datetime64[ns]
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 32.7+ MB

In [134]:
df1.info()

<class 'pandas.core.frame.DataFrame'>
RangeIndex: 1428383 entries, 0 to 1428382
Data columns (total 3 columns):
sensor    1428383 non-null object
time      1428383 non-null datetime64[ns]
value     1428383 non-null float64
dtypes: datetime64[ns](1), float64(1), object(1)
memory usage: 32.7+ MB

In [135]:
assert df.notna().all().all()
assert df1.notna().all().all()

In [136]:
missingdf = pd.DataFrame(df.isna().sum()).rename(columns = {0: 'total'})
missingdf['percent'] = missingdf['total'] / len(df)
missingdf

        total  percent
sensor      0      0.0
value       0      0.0
time        0      0.0

In [137]:
missingdf1 = pd.DataFrame(df.isna().sum()).rename(columns = {0: 'total'})
missingdf1['percent'] = missingdf1['total'] / len(df1)
missingdf1

        total  percent
sensor      0      0.0
value       0      0.0
time        0      0.0

No missing data and different format between data sensor T-DHT11-measures and H-DHT11-measures

T-DHT11 measures the temperature and H-DHT11 measures the humidity. Here I try to merge the data T-DHT11-measures and H-DHT11-measures, because the measurement time is almost the same

In [138]:
df.rename(columns={'sensor': 'humidity sensor','value' : 'humidity value'},inplace=True)

In [139]:
df.head()

  humidity sensor  humidity value                time
0         H-HTU21            28.3 2017-12-20 12:17:05
1         H-HTU21            28.2 2017-12-20 12:17:07
2         H-HTU21            28.1 2017-12-20 12:17:09
3         H-HTU21            28.2 2017-12-20 12:17:11
4         H-HTU21            28.2 2017-12-20 12:17:13

In [140]:
df1.rename(columns={'sensor': 'temperature sensor','value' : 'temperature value'},inplace=True)

In [141]:
df1.head()

  temperature sensor                time  temperature value
0            T-HTU21 2017-12-20 12:17:05              25.09
1            T-HTU21 2017-12-20 12:17:07              25.09
2            T-HTU21 2017-12-20 12:17:09              25.09
3            T-HTU21 2017-12-20 12:17:11              25.09
4            T-HTU21 2017-12-20 12:17:13              25.08

In [142]:
newdf =  pd.merge(df, df1, on='time', how='outer')

In [143]:
newdf.head()

,humidity sensor,humidity value,time,temperature sensor,temperature value
0,H-HTU21,28.3,2017-12-20 12:17:05,T-HTU21,25.09
1,H-HTU21,28.2,2017-12-20 12:17:07,T-HTU21,25.09
2,H-HTU21,28.1,2017-12-20 12:17:09,T-HTU21,25.09
3,H-HTU21,28.2,2017-12-20 12:17:11,T-HTU21,25.09
4,H-HTU21,28.2,2017-12-20 12:17:13,T-HTU21,25.08

In [144]:
newdf.tail()

,humidity sensor,humidity value,time,temperature sensor,temperature value
1510100,NaN,NaN,2018-03-13 11:39:02,T-HTU21,26.53
1510101,NaN,NaN,2018-03-13 11:39:23,T-HTU21,26.54
1510102,NaN,NaN,2018-03-13 11:40:47,T-HTU21,26.53
1510103,NaN,NaN,2018-03-13 11:41:50,T-HTU21,26.56
1510104,NaN,NaN,2018-03-13 11:42:11,T-HTU21,26.58

In [145]:
newdf = newdf.reindex(columns=['time','humidity sensor','humidity value','temperature sensor','temperature value'])
newdf = newdf[['time','humidity sensor','humidity value','temperature sensor','temperature value']]

In [146]:
newdf.head()

,time,humidity sensor,humidity value,temperature sensor,temperature value
0,2017-12-20 12:17:05,H-HTU21,28.3,T-HTU21,25.09
1,2017-12-20 12:17:07,H-HTU21,28.2,T-HTU21,25.09
2,2017-12-20 12:17:09,H-HTU21,28.1,T-HTU21,25.09
3,2017-12-20 12:17:11,H-HTU21,28.2,T-HTU21,25.09
4,2017-12-20 12:17:13,H-HTU21,28.2,T-HTU21,25.08

In [147]:
newdf.tail()

,time,humidity sensor,humidity value,temperature sensor,temperature value
1510100,2018-03-13 11:39:02,NaN,NaN,T-HTU21,26.53
1510101,2018-03-13 11:39:23,NaN,NaN,T-HTU21,26.54
1510102,2018-03-13 11:40:47,NaN,NaN,T-HTU21,26.53
1510103,2018-03-13 11:41:50,NaN,NaN,T-HTU21,26.56
1510104,2018-03-13 11:42:11,NaN,NaN,T-HTU21,26.58

In [148]:
newdf.count()

time                  1510105
humidity sensor       1428377
humidity value        1428377
temperature sensor    1428383
temperature value     1428383
dtype: int64

In [149]:
missingnewdf = pd.DataFrame(newdf.isna().sum()).rename(columns = {0: 'total'})
missingnewdf['percent'] = missingnewdf['total'] / len(newdf)
missingnewdf

                    total   percent
time                    0  0.000000
humidity sensor     81728  0.054121
humidity value      81728  0.054121
temperature sensor  81722  0.054117
temperature value   81722  0.054117

After merging the data from H-DHT11 and T-DHT11 sensor there are many missing data founded. This is maybe because the difference measurement time, so here I will try to interpolate the missing data.

Fill the NaN value on humidity value with intepolate data using time

In [150]:
newdf.set_index('time',inplace=True)
new_df = newdf.interpolate(method="time")

In [153]:
new_df.tail()

,humidity sensor,humidity value,temperature sensor,temperature value
time,,,,
2018-03-13 11:39:02,NaN,30.80,T-HTU21,26.53
2018-03-13 11:39:23,NaN,30.80,T-HTU21,26.54
2018-03-13 11:40:47,NaN,31.04,T-HTU21,26.53
2018-03-13 11:41:50,NaN,30.90,T-HTU21,26.56
2018-03-13 11:42:11,NaN,33.08,T-HTU21,26.58

Humidity sensor still have NaN value and we will try to use another method to fill in the NaN data

In [155]:
new_df1 = new_df.fillna(method="ffill")
new_df1.tail()

,humidity sensor,humidity value,temperature sensor,temperature value
time,,,,
2018-03-13 11:39:02,H-HTU21,30.80,T-HTU21,26.53
2018-03-13 11:39:23,H-HTU21,30.80,T-HTU21,26.54
2018-03-13 11:40:47,H-HTU21,31.04,T-HTU21,26.53
2018-03-13 11:41:50,H-HTU21,30.90,T-HTU21,26.56
2018-03-13 11:42:11,H-HTU21,33.08,T-HTU21,26.58

In [156]:
missingnewdf1 = pd.DataFrame(filldf.isna().sum()).rename(columns = {0: 'total'})
missingnewdf1['percent'] = missingnewdf1['total'] / len(filldf)
missingnewdf1

                    total  percent
time                    0      0.0
humidity sensor         0      0.0
humidity value          0      0.0
temperature sensor      0      0.0
temperature value       0      0.0

After interpolate the data no more missing value and I assume the data is clean

In [157]:
new_df1.count()

humidity sensor       1510105
humidity value        1510105
temperature sensor    1510105
temperature value     1510105
dtype: int64